Repository: Cyber-Syntax/my-unicorn
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: tr

source: Welcome to the my-unicorn 🦄!
tr: My-unicorn'a hoş geldiniz 🦄!

source: Choose one of the following options:
tr: Aşağıdaki seçeneklerden birini seçin:

source: 1. Update AppImage by config file
tr: 1. AppImage'i yapılandırma dosyası ile güncelle

source: 2. Download new AppImage (create config file)
tr: 2. Yeni AppImage indir (yapılandırma dosyası oluştur)

source: 3. Customize AppImage config file
tr: 3. AppImage yapılandırma dosyasını özelleştir

source: 4. Update all AppImages
tr: 4. Tüm AppImage'leri güncelle

source: 5. Exit
tr: 5. Çıkış

source: Enter your choice:
tr: Seçiminizi girin:

source: Error: {error}. Exiting...
tr: Hata: {error}. Çıkılıyor...

source: Function {function} not found
tr: Fonksiyon {function} bulunamadı

source: Downloading new appimage
tr: Yeni appimage indiriliyor

source: Choose one of the following options:
tr: Aşağıdaki seçeneklerden birini seçin:

source: 1. Backup old appimage and download new appimage
tr: 1. Eski appimage yedekle ve yeni appimage indir

source: 2. Download new appimage and overwrite old appimage
tr: 2. Yeni appimage indir ve eski appimage üzerine yaz

source: Exiting...
tr: Çıkılıyor...

source: Invalid choice
tr: Geçersiz seçim

source: 1. Download new appimage, save old appimage
tr: 1. Yeni appimage indir, eski appimage'i kaydet

source: 2. Download new appimage, don't save old appimage
tr: 2. Yeni appimage indir, eski appimage'i kaydetme

source: Invalid choice. Try again.
tr: Geçersiz seçim. Tekrar deneyin.

source: Invalid input. Please enter a valid number.
tr: Geçersiz giriş. Lütfen geçerli bir sayı girin.

source: Parsing the owner and repo from the url...
tr: URL'den sahibi ve depoyu ayrıştırma...

source: [41;30mError: {error}. Exiting...[0m
tr: [41;30mHata: {error}. Çıkılıyor...[0m

source: Available json files:
tr: Mevcut json dosyaları:

source: Invalid choice. Please write a number.
tr: Geçersiz seçim. Lütfen bir sayı yazın.

source: There is no .json file in the current directory
tr: Geçerli dizinde .json dosyası yok

source: Enter the app github url:
tr: Uygulama github url'sini girin:

source: Which directory to save appimage (Default: '~/Documents/appimages/' if you leave it blank):
tr: Appimage'i hangi dizine kaydetmek istiyorsunuz (Boş bırakılırsa varsayılan: '~/Documents/appimages/')

source: Which directory to save old appimage (Default: '~/Documents/appimages/backup/' if you leave it blank):
tr: Eski appimage'i hangi dizine kaydetmek istiyorsunuz (Boş bırakılırsa varsayılan: '~/Documents/appimages/backup/')

source: Enter the hash type for your sha(sha256, sha512) file:
tr: Sha dosyanız için hash türünü girin (sha256, sha512):

source: Saved credentials to config_files/{repo}.json file
tr: Kimlik bilgileri config_files/{repo}.json dosyasına kaydedildi

source: {path}{repo}.json File not found while trying to load credentials or unknown error.
tr: {path}{repo}.json dosyası yüklenirken kimlik bilgileri bulunamadı veya bilinmeyen hata.

source: Failed to get response from API: {api_url}
tr: API'den yanıt alınamadı: {api_url}

source: {repo}.AppImage is up to date
tr: {repo}.AppImage güncel

source: Version: {version}
tr: Sürüm: {version}

source: Current version: {version}
tr: Geçerli sürüm: {version}

source: [42mLatest version: {version}[0m
tr: [42mSon sürüm: {version}[0m

source: Couldn't find the sha file
tr: Sha dosyası bulunamadı

source: Enter the exact sha name:
tr: Tam sha adını girin:

source: {appimage_name} already exists in the current directory
tr: {appimage_name} geçerli dizinde zaten mevcut

source: {repo} downloading... Grab a cup of coffee :), it will take some time depending on your internet speed.
tr: {repo} indiriliyor... Bir kahve alın :), internet hızınıza bağlı olarak biraz zaman alacak.

source: [41;30mError downloading {appimage_name}[0m
tr: [41;30m{appimage_name} indirirken hata oluştu[0m

source: [42mDownload completed! {appimage_name} installed.[0m
tr: [42mİndirme tamamlandı! {appimage_name} yüklendi.[0m

source: Enter the sha name:
tr: Sha adını girin:

source: Enter the hash type:
tr: Hash türünü girin:

source: Enter the choice:
tr: Seçimi girin:

source: Enter new appimage folder:
tr: Yeni appimage klasörünü girin:

source: Enter new appimage folder backup:
tr: Yeni appimage yedekleme klasörünü girin:

source: [42mCredentials updated successfully[0m
tr: [42mKimlik bilgileri başarıyla güncellendi[0m

source: Invalid input or value error. Try again.
tr: Geçersiz giriş veya değer hatası. Tekrar deneyin.

source: Keyboard interrupt. Exiting...
tr: Klavye kesintisi. Çıkılıyor...

source: EOF error. Input cannot be empty.
tr: EOF hatası. Giriş boş olamaz.

source: Key error. The key doesn't exist.
tr: Anahtar hatası. Anahtar mevcut değil.

source: File not found error.
tr: Dosya bulunamadı hatası.

source: An unknown error occurred.
tr: Bilinmeyen bir hata oluştu.

source: Too many redirects. Try again.
tr: Çok fazla yönlendirme. Tekrar deneyin.

source: Invalid URL. Try again.
tr: Geçersiz URL. Tekrar deneyin.

source: Timeout error. Try again.
tr: Zaman aşımı hatası. Tekrar deneyin.

source: Connection error. Try again.
tr: Bağlantı hatası. Tekrar deneyin.

source: Request error. Check network connection and try again.
tr: İstek hatası. Ağ bağlantınızı kontrol edin ve tekrar deneyin.

source: HTTP error. Check network connection and try again.
tr: HTTP hatası. Ağ bağlantınızı kontrol edin ve tekrar deneyin.

source: Downloading {sha_name}...
tr: {sha_name} indiriliyor...

source: [42mDownloaded {sha_name}[0m
tr: [42m{sha_name} indirildi[0m

source: {sha_name} already exists
tr: {sha_name} zaten mevcut

source: {sha_name} already exists but it is different from the downloaded one
tr: {sha_name} zaten mevcut ancak indirilen dosyadan farklı

source: Do you want to overwrite it? (y/n):
tr: Üzerine yazmak istiyor musunuz? (e/h):

source: [41;30mError verifying {appimage_name}[0m
tr: [41;30m{appimage_name} doğrulanırken hata oluştu[0m

source: Do you want to delete the downloaded appimage? (y/n):
tr: İndirilen appimage'i silmek istiyor musunuz? (e/h):

source: Deleted {appimage_name}
tr: {appimage_name} silindi

source: Do you want to delete the downloaded sha file? (y/n):
tr: İndirilen sha dosyasını silmek istiyor musunuz? (e/h):

source: Deleted {sha_name}
tr: {sha_name} silindi

source: Do you want to continue without verification? (y/n):
tr: Doğrulama yapmadan devam etmek istiyor musunuz? (e/h):

source: [41;30mError connecting to {sha_url}[0m
tr: [41;30m{sha_url} adresine bağlanırken hata oluştu[0m

source: Deleted {new_name}
tr: {new_name} silindi

source: {appimage_name} saved in {cwd}
tr: {appimage_name} {cwd} içine kaydedildi

source: [42m{appimage_name} verified.[0m
tr: [42m{appimage_name} doğrulandı.[0m

source: --------------------- HASHES ----------------------
tr: --------------------- HASHLER ----------------------

source: Parsed Hash: {decoded_hash}
tr: Çözülmüş Hash: {decoded_hash}

source: --------------------- CHANGES ----------------------
tr: --------------------- DEĞİŞİKLİKLER ----------------------

source: Moving old {repo}.AppImage to {backup}
tr: Eski {repo}.AppImage {backup} içine taşınıyor

source: Changing {appimage_name} name to {repo}.AppImage
tr: {appimage_name} adı {repo}.AppImage olarak değiştiriliyor

source: Moving updated appimage to {folder}
tr: Güncellenmiş appimage {folder} içine taşınıyor

source: Updating credentials in {repo}.json
tr: {repo}.json içinde kimlik bilgileri güncelleniyor

source: Deleting {sha_name}
tr: {sha_name} siliniyor

source: Do you want to continue? (y/n):
tr: Devam etmek istiyor musunuz? (e/h):

source: Appimage installed but not moved to the appimage folder
tr: Appimage yüklendi ancak appimage klasörüne taşınmadı

source: Making the appimage executable...
tr: Appimage çalıştırılabilir hale getiriliyor...

source: [42mAppimage is now executable[0m
tr: [42mAppimage şimdi çalıştırılabilir[0m

source: Backup folder {backup_folder} found
tr: Yedekleme klasörü {backup_folder} bulundu

source: Backup folder {backup_folder} not found, do you want to create it (y/n):
tr: Yedekleme klasörü {backup_folder} bulunamadı, oluşturmak istiyor musunuz? (e/h):

source: Created backup folder: {backup_folder}
tr: Yedekleme klasörü oluşturuldu: {backup_folder}

source: Backup folder not created.
tr: Yedekleme klasörü oluşturulmadı.

source: Found {repo}.AppImage in {folder}
tr: {repo}.AppImage {folder} içinde bulundu

source: [41;30mError moving {repo}.AppImage to {backup_folder}[0m
tr: [41;30m{repo}.AppImage {backup_folder} içine taşınırken hata oluştu[0m

source: Old {old_appimage} copied to {backup_folder}
tr: Eski {old_appimage} {backup_folder} içine kopyalandı

source: {repo}.AppImage not found in {folder}
tr: {repo}.AppImage {folder} içinde bulunamadı

source: Changing {appimage_name} name to {new_name}
tr: {appimage_name} adı {new_name} olarak değiştiriliyor

source: The appimage name is already the new name
tr: Appimage adı zaten yeni ad

source: [41;30mError moving {repo}.AppImage to {folder}[0m
tr: [41;30m{repo}.AppImage {folder} içine taşınırken hata oluştu[0m

source: Moved {repo}.AppImage to {folder}
tr: {repo}.AppImage {folder} klasörüne taşındı

source: Updating credentials...
tr: Kimlik bilgileri güncelleniyor...

source: [42mCredentials updated to {repo}.json[0m
tr: [42mKimlik bilgileri {repo}.json dosyasına güncellendi[0m

source: Found the following config files in the [{file_path}]:
tr: Aşağıdaki yapılandırma dosyaları bulundu [{file_path}] klasöründe:

source: No JSON files found in the directory.
tr: Dizinde JSON dosyası bulunamadı.

source: {appimage} is up to date
tr: {appimage} güncel

source: {appimage} is not up to date
tr: {appimage} güncel değil

source: All appimages are up to date
tr: Tüm appimage dosyaları güncel

source: Appimages that are not up to date:
tr: Güncel olmayan appimage dosyaları:

source: Enter the numbers of the appimages you want to update (comma-separated) or type 'skip' to skip updates:
tr: Güncellemek istediğiniz appimage dosyalarının numaralarını girin (virgülle ayırarak) veya güncellemeleri atlamak için 'skip' yazın:

source: No updates will be performed.
tr: Güncelleme yapılmayacak.

source: Enable batch mode to continue without asking for approval? (y/n):
tr: Onay istemeden devam etmek için toplu modu etkinleştirilsin mi? (e/h):

source: Batch mode is enabled. All selected appimages will be updated without further prompts.
tr: Toplu mod etkinleştirildi. Seçilen tüm appimage dosyaları başka bir uyarı olmadan güncellenecek.

source: Batch mode is disabled. You will be prompted for each appimage update.
tr: Toplu mod devre dışı bırakıldı. Her appimage güncellemesi için uyarılacaksınız.

source: Updating {appimage}...
tr: {appimage} güncelleniyor...

source: Update process completed for all selected appimages.
tr: Seçilen tüm appimage dosyalarının güncelleme işlemi tamamlandı.

source: 1. SHA file name
tr: 1. SHA dosya adı

source: 2. hash type
tr: 2. hash türü

source: 3. choice
tr: 3. seçenek

source: 4. appimage folder
tr: 4. appimage dizini

source: 5. appimage folder backup
tr: 5. appimage dizini yedeği

source: 6. Exit
tr: 6. Çıkış
